Tekla.Structures.Internal.ConnectUploads.Local
Represents the local file info for the upload to Connect.

Tekla.Structures.Internal.ConnectUploads.Local.Path
Gets or sets the path of the local file.

Tekla.Structures.Internal.ConnectUploads.Local.FileHash
Gets or sets the hash of the local file.

Tekla.Structures.Internal.ConnectUploads.Local.EventName
Gets or sets the name of the database event used to store the time GUID
when the upload file was created.

Tekla.Structures.Internal.ConnectUploads.Local.CreatedTimeGuid
Gets or sets the time GUID when the upload file was created.